# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cursor = connection.cursor()

## Display the names of all the employees in Boston.

In [6]:
#Your code here
cursor.execute('''SELECT lastName, firstName FROM employees join offices using (officecode) WHERE offices.city = "Boston";''').fetchall()

[('Firrelli', 'Julie'), ('Patterson', 'Steve')]

## Do any offices have no employees?

In [9]:
#Your code here
cursor.execute('''SELECT officecode FROM offices left join employees using (officecode) WHERE employeenumber is NULL;''').fetchall()

[]

In [11]:
# No offices have no employees!

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
#

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [14]:
import pandas as pd

In [15]:
# Your code here
df = pd.DataFrame(cursor.execute('''SELECT firstName, lastName, productName
                        FROM employees e
                        join customers c
                        on e.employeeNumber = c.salesrepEmployeeNumber
                        join orders o
                        using (customerNumber)
                        join orderdetails od
                        using (orderNumber)
                        join products p
                        using (productCode);''').fetchall())
print(len(df))

2996

## Level Up: Display the Number of Products each Employee Has sold

In [17]:
#Your code here
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!